src/Documents/ПеремещениеТоваров/ПеремещениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ПеремещениеТоваров/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПеремещениеТоваров.ПолучитьМакет("НакладнаяНаПеремещение");
	
	ОбластьШапкаДок = Макет.ПолучитьОбласть("ШапкаДок");
	ОбластьШапкаТаб = Макет.ПолучитьОбласть("ШапкаТаб");
	ОбластьПодвал	= Макет.ПолучитьОбласть("Подвал"); 	
	
	ЗапросШапка = Новый Запрос;
	ЗапросШапка.Текст = "ВЫБРАТЬ
	|	ПеремещениеТоваров.Номер,
	|	ПеремещениеТоваров.Дата,
	|	ПеремещениеТоваров.СкладОтправитель,
	|	ПеремещениеТоваров.СкладПолучатель
	|ИЗ
	|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров";
	ЗапросШапка.УстановитьПараметр("Ссылка", Ссылка);	
	ДанныеШапки = ЗапросШапка.Выполнить().Выбрать();	
	ДанныеШапки.Следующий(); 	
	
	ОбластьШапкаДок.Параметры.Заполнить(ДанныеШапки);
	ТабДок.Вывести(ОбластьШапкаДок);
		
	ЗапросТовары = Новый Запрос;
	ЗапросТовары.Текст = "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.НомерСтроки,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдИзм,
	|	ПеремещениеТоваровТовары.Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	ЗапросТовары.УстановитьПараметр("Ссылка", Ссылка);
	ДанныеТЧ = ЗапросТовары.Выполнить().Выбрать();
	
	Пока ДанныеТЧ.Следующий() Цикл
		
		ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТаб");		
		ОбластьСтрокаТЧ.Параметры.Заполнить(ДанныеТЧ);
		ТабДок.Вывести(ОбластьСтрокаТЧ);
				
	КонецЦикла;

	ТабДок.Вывести(ОбластьПодвал);		
	
КонецПроцедуры
